// одномерный массив, варианты создания  


int[] arr = new int[5];// создание переменной одн. массива на пять элементов
arr[0] = 21; //значение элементов  добавляются построчно
arr[1] = 25;
arr[2] = 121;
arr[3] = 31;
arr[4] = 45;

Console.WriteLine(arr[0]);//вывод элементов
Console.WriteLine(arr[1]);
Console.WriteLine(arr[2]);
Console.WriteLine(arr[3]);
Console.WriteLine(arr[4]);

int[] arr2 = new int[5] { 14, 52, 45, 56, 85, }; //второй вид создание переменной одн. массива на пять элементов




int[] arr3 = {52,85,94,76,103};// третий вид создание переменной одн. массива на пять элементов

